cf/ChartsOfAccounts/Bookkeeping.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ChartOfAccounts>
		<Properties>
			<Name>Bookkeeping</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.BookkeepingExtDimensions</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>_Final</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BalanceSide</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AccountBalanceSides</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BalanceType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AccountBalanceTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CodeForInput</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ForbidToUseWhenPosting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Purpose</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AccountPurpose</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtDimension1Type</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.BookkeepingExtDimensions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtDimension1Mandatory</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtDimension2Type</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.BookkeepingExtDimensions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtDimension2Mandatory</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtDimension3Type</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.BookkeepingExtDimensions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExtDimension3Mandatory</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalView</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NotValid</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FinancialYearsBegin</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FinancialYears</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FinancialYearsEnd</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FinancialYears</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Resultant</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Mandatory</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

cf/Catalogs/FinancialYears.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>FinancialYears</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Closed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/ChartsOfAccounts/Bookkeeping/Forms/ListFormManaged/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Items.List.ChoiceMode = Parameters.ChoiceMode;
EndProcedure


&AtClient
Procedure OnOpen(Cancel)
	YearValidity = CommonAtServer.GetLastFinancialYear();
	YearValidityOnChange(Undefined);
EndProcedure

&AtClient
Procedure ChoiceProcessing(SelectedValue, ChoiceSource)
	YearValidityOnChangeAtServer();		
	Items.List.CurrentRow = SelectedValue;
EndProcedure

&AtClient
Procedure ListBeforeAddRow(Item, Cancel, Clone, Parent, Folder, Parameter)
	
	If Clone Then
		Return;
	EndIf;
	
	Cancel = True;
	
	ParametersFormSettings = New Structure;
	
	// by Jack ParametersFormSettings.Insert("Account",Item.CurrentData.Ref);
	// by Jack 30.03.2017 add begin
	If Item.CurrentData<>Undefined Then 
	   ParametersFormSettings.Insert("Account",Item.CurrentData.Ref);
	EndIf;
	// by Jack 30.03.2017 add end

	
	NotifyDescription = New NotifyDescription("OnCloseParentChoice",ThisForm);	
	OpenForm("ChartOfAccounts.Bookkeeping.Form.NewAccountParentChoiceFormManaged",ParametersFormSettings,,,,,NotifyDescription);
	
EndProcedure

&AtClient
Procedure OnCloseParentChoice(Result, ParametersStructure) Export
	If TypeOf(Result) = Type("ChartOfAccountsRef.Bookkeeping")  Then
		OpenForm("ChartOfAccounts.Bookkeeping.ObjectForm", New Structure("Parent,ChoiceMode", Result,True),ThisForm);			
	EndIf;	
EndProcedure	

&AtClient
Procedure YearValidityOnChange(Item)
	YearValidityOnChangeAtServer();
EndProcedure

&AtServer
Procedure YearValidityOnChangeAtServer()
	FilterRef = Undefined;
	For Counter = 0 To List.Filter.Items.Count()-1 Do
		CurrentFilter = List.Filter.Items[Counter];
		If CurrentFilter.LeftValue = List.Filter.FilterAvailableFields.Items.Find("Ref").Field Then
			FilterRef = CurrentFilter;
		EndIf; 
	EndDo;  
	If FilterRef=Undefined Then
		FilterRef = List.Filter.Items.Add(Type("DataCompositionFilterItem"));	
	EndIf;

	If ValueIsFilled(YearValidity) Then
		Query = New Query;
		Query.Text = "SELECT
		             |	Bookkeeping.Ref
		             |FROM
		             |	ChartOfAccounts.Bookkeeping AS Bookkeeping
		             |WHERE
		             |	CASE
		             |			WHEN Bookkeeping.FinancialYearsBegin = VALUE(Catalog.FinancialYears.EmptyRef)
		             |				THEN TRUE
		             |			ELSE Bookkeeping.FinancialYearsBegin.DateFrom <= &DateEndYearValidity
		             |		END
		             |	AND CASE
		             |			WHEN Bookkeeping.FinancialYearsEnd = VALUE(Catalog.FinancialYears.EmptyRef)
		             |				THEN TRUE
		             |			ELSE Bookkeeping.FinancialYearsEnd.DateTo >= &DateStartYearValidity
		             |		END";
		
		Query.SetParameter("DateStartYearValidity", YearValidity.DateFrom);
		Query.SetParameter("DateEndYearValidity", YearValidity.DateTo);
		
		ValueForFilter = New ValueList;
		ValueForFilter.LoadValues(Query.Execute().Unload().UnloadColumn("Ref"));
	
		FilterRef.ComparisonType = DataCompositionComparisonType.InList;
		FilterRef.LeftValue = List.Filter.FilterAvailableFields.Items.Find("Ref").Field;
		FilterRef.RightValue = ValueForFilter;
		FilterRef.Use = True;		
	Else
		FilterRef.ComparisonType = DataCompositionComparisonType.InList;
		FilterRef.LeftValue = List.Filter.FilterAvailableFields.Items.Find("Ref").Field;
		FilterRef.RightValue = Undefined;		
		FilterRef.Use = False;
	EndIf;
	
EndProcedure

&AtClient
Procedure CommandPrintOut(Command)
	OpenForm("ChartOfAccounts.Bookkeeping.Form.PrintOutFormManaged",New Structure("YearValidity", YearValidity)  , ThisForm);
EndProcedure
